<h1 style='text-align: center'>SQL Queries</h1>

## Getting Data From A SQL Database

### The Structure of a SQL Query

<img src='images/sql_statement.jpg'/>

#### SELECT

- What columns of data do we want? 
- Specify by column names or * (All)

- Where are we getting our data from? 
- Specify by table name or use join statement to join multiple tables

##### JOIN

- Use to join multiple tables 
- SELECT * FROM students join favorite_foods on students.id = favorite_foods.student_id
- SELECT * FROM students as s join favorite_foods as f on s.id = f.student_id

#### WHERE

- apply some filter to the data you are querying 
- define criteria for data that should selected from the database 
- SELECT * from students WHERE age > 10

#### GROUP BY

- Group columns by similar values
- SELECT COUNT(id), city from students GROUP BY city

#### HAVING

- Use to apply filter AFTER you have made your initial query 
- When should we use HAVING instead of WHERE

In [5]:
import sqlite3

conn = sqlite3.connect('tutorial.db')
c = conn.cursor()

In [7]:
# Load students.json file

#your code here
import json
f=open('students.json','r')
data=json.load(f)
data

[{'name': 'Sean Abu Wilson',
  'birthdate': '02/06',
  'siblings': 2,
  'Birthplace': 'Birmingham, AL',
  'yearsinnyc': 7.8,
  'favoritefood': 'guacamole'},
 {'name': 'Tawab',
  'birthdate': '04/08/1998',
  'siblings': 4,
  'Birthplace': 'Afghanistan',
  'yearsinnyc': 0.5,
  'favoritefood': 'pizza'},
 {'name': 'Bridget Boakye',
  'birthdate': '1990-07-13',
  'siblings': 3,
  'Birthplace': 'Accra',
  'yearsinnyc': 15,
  'favoritefood': 'Indian'},
 {'name': 'Cristina',
  'birthdate': '9/9/1990',
  'siblings': 2,
  'Birthplace': 'Spain',
  'yearsinnyc': 6,
  'favoritefood': 'Sushi'},
 {'name': 'Danny (Haoyang) Yu',
  'birthdate': '1997-03-19',
  'siblings': 2,
  'Birthplace': '1997-03-19',
  'yearsinnyc': 0,
  'favoritefood': 'Galbi'},
 {'name': 'Dustin_Breitner',
  'birthdate': '04/15/94',
  'siblings': 2,
  'Birthplace': 'New_York',
  'yearsinnyc': 3,
  'favoritefood': 'Pizza'},
 {'name': 'Gregory DeSantis',
  'birthdate': '1987-11-23',
  'siblings': 2,
  'Birthplace': 'Highland Park, NJ',
  'yearsinnyc': 13,
  'favoritefood': 'Pizza'},
 {'name': 'Harrison Miller',
  'birthdate': '10/2/85',
  'siblings': 0,
  'Birthplace': 'New Jersey',
  'yearsinnyc': 0,
  'favoritefood': 'Pizza'},
 {'name': 'Jeremy Owens',
  'birthdate': '03/30/1990',
  'siblings': 0,
  'Birthplace': 'Virginia',
  'yearsinnyc': 6,
  'favoritefood': 'Avocado'},
 {'name': 'Jeremy Reikes',
  'birthdate': '1-/12/1995',
  'siblings': 1,
  'Birthplace': 'New York City',
  'yearsinnyc': 23,
  'favoritefood': 'Pizza'},
 {'name': 'Johnathan Peck',
  'birthdate': '02-19-1994',
  'siblings': 2,
  'Birthplace': 'New York',
  'yearsinnyc': 25,
  'favoritefood': 'Moms food'},
 {'name': 'Minna F',
  'birthdate': '11-19-1996',
  'siblings': 3,
  'Birthplace': 'San Francisco',
  'yearsinnyc': 1,
  'favoritefood': 'sushi'},
 {'name': 'Nabil Abbas',
  'birthdate': '12-07-1994',
  'siblings': 2,
  'Birthplace': 'Long Island',
  'yearsinnyc': 6,
  'favoritefood': 'Gyro'},
 {'name': 'Natalie Del Rossi',
  'birthdate': '10-23-1994',
  'siblings': 0,
  'Birthplace': 'Brooklyn',
  'yearsinnyc': 18,
  'favoritefood': 'pizza'},
 {'name': 'Remy Canario',
  'birthdate': '10-11-1988',
  'siblings': 0,
  'Birthplace': 'New York',
  'yearsinnyc': 28,
  'favoritefood': 'toast'},
 {'name': 'Xristos Katsaros',
  'birthdate': '03-24-1986',
  'siblings': 1,
  'Birthplace': 'Chicago Heights, IL',
  'yearsinnyc': 3,
  'favoritefood': 'Pizza'}]

In [29]:
c.execute("""DROP TABLE afternoon_database;""")

In [30]:
c.execute('''
CREATE TABLE IF NOT EXISTS students 
(name TEXT, birthdate TEXT, siblings INTEGER, 
Birthplace TEXT, yearsinnyc INTEGER, favoritefood TEXT)
''')

In [31]:
# dynamic data entry example
def dynamic_data_entry(student):

    name = student['name']
    birthdate = student['birthdate']
    siblings = student['siblings']
    Birthplace = student['Birthplace']
    yearsinnyc = student['yearsinnyc']
    favoritefood = student['favoritefood']

    c.execute("INSERT INTO students VALUES (?, ?, ?, ?, ?, ?)",
          (name, birthdate, siblings, Birthplace, yearsinnyc, favoritefood))

    conn.commit()

for student in data:
    dynamic_data_entry(student)


# c.close
# conn.close()

In [32]:
c.execute("""SELECT * FROM students""").fetchall()

[('Sean Abu Wilson', '02/06', 2, 'Birmingham, AL', 7.8, 'guacamole'),
 ('Tawab', '04/08/1998', 4, 'Afghanistan', 0.5, 'pizza'),
 ('Bridget Boakye', '1990-07-13', 3, 'Accra', 15, 'Indian'),
 ('Cristina', '9/9/1990', 2, 'Spain', 6, 'Sushi'),
 ('Danny (Haoyang) Yu', '1997-03-19', 2, '1997-03-19', 0, 'Galbi'),
 ('Dustin_Breitner', '04/15/94', 2, 'New_York', 3, 'Pizza'),
 ('Gregory DeSantis', '1987-11-23', 2, 'Highland Park, NJ', 13, 'Pizza'),
 ('Harrison Miller', '10/2/85', 0, 'New Jersey', 0, 'Pizza'),
 ('Jeremy Owens', '03/30/1990', 0, 'Virginia', 6, 'Avocado'),
 ('Jeremy Reikes', '1-/12/1995', 1, 'New York City', 23, 'Pizza'),
 ('Johnathan Peck', '02-19-1994', 2, 'New York', 25, 'Moms food'),
 ('Minna F', '11-19-1996', 3, 'San Francisco', 1, 'sushi'),
 ('Nabil Abbas', '12-07-1994', 2, 'Long Island', 6, 'Gyro'),
 ('Natalie Del Rossi', '10-23-1994', 0, 'Brooklyn', 18, 'pizza'),
 ('Remy Canario', '10-11-1988', 0, 'New York', 28, 'toast'),
 ('Xristos Katsaros', '03-24-1986', 1, 'Chicago Heights, IL', 3, 'Pizza')]

### Questions
1. What are the names of all of the students?
2. Which student has the most siblings?
3. How many students are only children?
4. Which 3 students have lived in NYC the shortest amount of time?
5. How many students are native New Yorkers?
6. Do any two students have the same favorite food?
7. Which student was born closest to the cohort's graduation date?

In [39]:
c.execute("""SELECT name FROM students;""").fetchall()

[('Sean Abu Wilson',),
 ('Tawab',),
 ('Bridget Boakye',),
 ('Cristina',),
 ('Danny (Haoyang) Yu',),
 ('Dustin_Breitner',),
 ('Gregory DeSantis',),
 ('Harrison Miller',),
 ('Jeremy Owens',),
 ('Jeremy Reikes',),
 ('Johnathan Peck',),
 ('Minna F',),
 ('Nabil Abbas',),
 ('Natalie Del Rossi',),
 ('Remy Canario',),
 ('Xristos Katsaros',)]

In [59]:
c.execute("""SELECT name, siblings FROM students WHERE siblings == 
(SELECT max(siblings) FROM students)""").fetchall()

[('Tawab', 4)]

In [76]:
c.execute("""UPDATE students
SET Birthplace ='New York'
WHERE Birthplace == 'New_York'""")
c.execute("""UPDATE students
SET Birthplace ='New York'
WHERE Birthplace == 'Brooklyn'""")
c.execute("""UPDATE students
SET Birthplace ='New York'
WHERE Birthplace == 'Long Island'""")
c.execute("""UPDATE students
SET Birthplace ='New York'
WHERE Birthplace == 'New York City'""")

In [42]:
c.execute("""SELECT count(*) FROM students WHERE siblings == 0;""").fetchall()

[(4,)]

In [44]:
c.execute("""SELECT name FROM students ORDER BY yearsinnyc ASC LIMIT 3;""").fetchall()

[('Danny (Haoyang) Yu',), ('Harrison Miller',), ('Tawab',)]

In [80]:
c.execute("""SELECT count(*) FROM students WHERE Birthplace == 'New York';""").fetchall()

[(6,)]

In [89]:
c.execute("""UPDATE students
SET favoritefood ='Pizza'
WHERE favoritefood LIKE '%izza'""")

In [91]:
c.execute("""SELECT favoritefood, COUNT(favoritefood) FROM students
GROUP BY favoritefood HAVING COUNT(favoritefood) >1;""").fetchall()

[('Pizza', 7)]

In [95]:
c.execute("""SELECT name, birthdate FROM students ORDER BY birthdate;""").fetchall()

[('Johnathan Peck', '02-19-1994'),
 ('Sean Abu Wilson', '02/06'),
 ('Xristos Katsaros', '03-24-1986'),
 ('Jeremy Owens', '03/30/1990'),
 ('Tawab', '04/08/1998'),
 ('Dustin_Breitner', '04/15/94'),
 ('Jeremy Reikes', '1-/12/1995'),
 ('Remy Canario', '10-11-1988'),
 ('Natalie Del Rossi', '10-23-1994'),
 ('Harrison Miller', '10/2/85'),
 ('Minna F', '11-19-1996'),
 ('Nabil Abbas', '12-07-1994'),
 ('Gregory DeSantis', '1987-11-23'),
 ('Bridget Boakye', '1990-07-13'),
 ('Danny (Haoyang) Yu', '1997-03-19'),
 ('Cristina', '9/9/1990')]